---
kind: method
id: M:Autodesk.Revit.DB.ConicalSurface.GetFrameOfReference
source: html/59ae1045-6128-4daa-ca37-db36309d9905.htm
---
# Autodesk.Revit.DB.ConicalSurface.GetFrameOfReference Method

Returns frame of reference associated with this ConicalSurface.

## Syntax (C#)
```csharp
public Frame GetFrameOfReference()
```

## Returns
Frame of reference associated with this ConicalSurface.

## Remarks
This is an equivalent of new Frame(Origin, XDir, YDir, Axis).